gordonthree/esp32-canbus-node-v3/src/main.cpp
/** Inline function to validate sub-module index */
inline bool isValidSubModuleIndex(uint8_t index) { return (index < MAX_SUB_MODULES); }

/**
 * @brief Handles specialized FastLED initialization for ARGB sub-modules.
 * @param index The sub-module index (used to index ledData arrays).
 * @param sub   Reference to the sub-module configuration.
 */
void initArgbHardware(uint8_t index, subModule_t& sub)
{
#ifdef ARGB_LED

    if (index >= MAX_SUB_MODULES) return;
    const personalityDef_t* p = &g_personalityTable[sub.personalityIndex];
    if (!p) return;


    uint8_t  dataPin    = p->gpioPin;
    uint16_t pixelCount = sub.config.argb.ledCount;

    if (pixelCount > MAX_PIXEL_COUNT)
        pixelCount = MAX_PIXEL_COUNT;

    /* Free old strip if reinitializing */
    if (g_argbStrips[index] != nullptr)
        delete g_argbStrips[index];

    /* Allocate new strip */
    g_argbStrips[index] =
        new NeoPixelBus<NeoGrbFeature, NeoEsp32Rmt0800KbpsMethod>(pixelCount, dataPin);

    if (g_argbStrips[index] != nullptr)
    {
        g_argbStrips[index]->Begin();
        g_argbStrips[index]->Show();
        Serial.printf("ARGB Init: submod %d pin %d count %d\n", index, dataPin, pixelCount);
    }
    else
    {
        Serial.printf("ARGB Init FAILED: submod %d pin %d count %d\n", index, dataPin, pixelCount);
    }
#endif
}


/**
 * @brief Initializes digital inputs such as physical switches and buttons.
 * @param i          The sub-module index (used to index submodule array).
 * @param sub        Reference to the sub-module configuration.
 * @details Configure the pull-up/pull-down resistor and initialize the input pin.
 * @note This function is called by the initHardware() function during setup().
 */
void initGPIOInput(uint8_t i, subModule_t& sub)
{
    const personalityDef_t* p = &g_personalityTable[sub.personalityIndex];  /**< Personality definition */
    const gpio_num_t pin = (gpio_num_t)p->gpioPin;                          /**< ESP‑IDF pin enum */
        
    gpio_config_t cfg = {};                                                 /**< GPIO config struct */
    cfg.mode         = GPIO_MODE_INPUT;                                     /**< Input mode */
    cfg.intr_type    = GPIO_INTR_DISABLE;                                   /**< ISR enabled later */
    cfg.pin_bit_mask = (1ULL << pin);                                       /**< Target pin mask */

    /* Configure pull resistors */
    const uint8_t pull = INPUT_FLAG_GET_PULL(sub.config.gpioInput.flags);
    switch (pull) {
        case INPUT_RES_PULLUP:
            cfg.pull_up_en   = GPIO_PULLUP_ENABLE;                  /**< Enable pull‑up */
            cfg.pull_down_en = GPIO_PULLDOWN_DISABLE;
            Serial.printf("Submod %d: Digital Input Init Pull-Up (Pin %d)\n", i, p->gpioPin);
            break;

        case INPUT_RES_PULLDOWN:
            cfg.pull_up_en   = GPIO_PULLUP_DISABLE;
            cfg.pull_down_en = GPIO_PULLDOWN_ENABLE;                /**< Enable pull‑down */
            Serial.printf("Submod %d: Digital Input Init Pull-Down (Pin %d)\n", i, p->gpioPin);
            break;

        case INPUT_RES_FLOATING:
        default:
            cfg.pull_up_en   = GPIO_PULLUP_DISABLE;
            cfg.pull_down_en = GPIO_PULLDOWN_DISABLE;               /**< Floating input */
            Serial.printf("Submod %d: Digital Input Init Floating (Pin %d)\n", i, p->gpioPin);
            break;
    }

    gpio_config(&cfg);                                              /**< Apply configuration */
}


/**
 * @brief Initializes a PWM output sub-module.
 * @details This function is responsible for setting up the ESP32 LEDC driver for a PWM output sub-module.
 * The function takes two parameters: the index of the sub-module and a reference to the sub-module configuration.
 * The function sets up the LEDC driver with the channel set to the index, the frequency set to the configured frequency
 * multiplied by the PWM scaling factor, and the resolution set to 8-bit.
 * The function then attaches the PWM output pin to the LEDC driver and stores the pin number in the pwmPins array.
 * Finally, the function prints a debug message indicating the sub-module index, the PWM output pin, and the configured frequency.
 * @param i Index of the output switch / submodule.
 * @param sub Reference to the sub-module configuration.
 */
void initPwmHardware(uint8_t i, subModule_t& sub)
{
    const personalityDef_t* p = &g_personalityTable[sub.personalityIndex];   /**< Personality definition */
    const gpio_num_t pin = (gpio_num_t)p->gpioPin;                   /**< ESP‑IDF pin enum */

    /* ------------------------------------------------------------------------
     *  LEDC TIMER CONFIGURATION
     * ---------------------------------------------------------------------- */

    const uint32_t freq_hz =
        (uint32_t)(sub.config.gpioOutput.param1 * PWM_SCALING_FACTOR); /**< Scaled frequency */

    const ledc_timer_t timer =
        (ledc_timer_t)(i / LEDC_CHANNELS_PER_TIMER);                   /**< Timer index */

    ledc_timer_config_t tcfg = {
        .speed_mode       = LEDC_LOW_SPEED_MODE,                       /**< Low‑speed group */
        .duty_resolution  = LEDC_TIMER_8_BIT,                          /**< 8‑bit resolution */
        .timer_num        = timer,                                     /**< Timer selection */
        .freq_hz          = freq_hz,                                   /**< PWM frequency */
        .clk_cfg          = LEDC_USE_RTC8M_CLK                        /**< 8 MHz clock */
    };

    ledc_timer_config(&tcfg);                                          /**< Apply timer config */

    /* ------------------------------------------------------------------------
     *  LEDC CHANNEL CONFIGURATION
     * ---------------------------------------------------------------------- */

    const ledc_channel_t channel = (ledc_channel_t)i;                  /**< Channel index */

    ledc_channel_config_t ccfg = {
        .gpio_num       = pin,                                         /**< Output pin */
        .speed_mode     = LEDC_LOW_SPEED_MODE,                         /**< Low‑speed group */
        .channel        = channel,                                     /**< Channel selection */
        .intr_type      = LEDC_INTR_DISABLE,                           /**< No interrupts */
        .timer_sel      = timer,                                       /**< Timer binding */
        .duty           = 0,                                           /**< Start at 0% */
        .hpoint         = 0                                            /**< Default hpoint */
    };

    ledc_channel_config(&ccfg);                                        /**< Apply channel config */

    /* ------------------------------------------------------------------------
     *  BOOKKEEPING
     * ---------------------------------------------------------------------- */

