gordonthree/esp32-canbus-node-v3/src/main.cpp
    pwmPins[i] = pin;                                                  /**< Track pin assignment */

    Serial.printf("Submod %d: PWM Output Init (Pin %d, Freq %u Hz)\n",
                  i, p->gpioPin, freq_hz);
}


/**
 * @brief Clears a PWM pin's configuration and detaches it from the LEDC driver.
 * @details This function is typically called when a sub-module is deinitialized.
 * @param i Index of the output switch / submodule.
 */
void clearPwmHardware(uint8_t i) {
    ledcDetachPin(pwmPins[i]);
    pwmPins[i] = 0;
}

void initGpioOutput(uint8_t i, subModule_t& sub) {
  const personalityDef_t* p = &g_personalityTable[sub.personalityIndex]; /**< Pointer to the personality definition for this sub-module */

  pinMode(p->gpioPin, OUTPUT);
  Serial.printf("Submod %d: Digital Output Init (Pin %d)\n", i, p->gpioPin);
} 

void initAnalogInput(uint8_t i, subModule_t& sub) {
  const personalityDef_t* p = &g_personalityTable[sub.personalityIndex]; /**< Pointer to the personality definition for this sub-module */

  pinMode(p->gpioPin, ANALOG);
  Serial.printf("Submod %d: Analog Input Init (Pin %d)\n", i, p->gpioPin);
}

/**
 * @brief Initializes all sub-modules based on their intro message IDs.
 * @details Iterates through the sub-module array and calls the appropriate init function based on the intro message ID.
 * @note This function is called once by the main setup() function.
 */
void initHardware() {
  Serial.println("[HW] Initializing sub-modules...");

  for (int i = 0; i < node.subModCnt; i++) {
    subModule_t& sub = node.subModule[i];
    const personalityDef_t* p = &g_personalityTable[sub.personalityIndex]; /**< Pointer to the personality definition for this sub-module */

    if (sub.introMsgId == 0) continue;

    switch (sub.introMsgId) {
      case DISP_ARGB_BACKLIGHT_ID:
      case DISP_ARGB_LED_STRIP_ID:
      case DISP_ARGB_BUTTON_BACKLIGHT_ID:
        initArgbHardware(i, sub);
        break;

      case INPUT_DIGITAL_GPIO_ID:
        initGPIOInput(i, sub);                           /* Configure the hardware */
        attachDigitalInputISR(p->gpioPin, i);            /* Register and attach the interrupt handler to the pin */
        if (sub.producer_flags & PRODUCER_FLAG_ENABLED){ /* If the producer is enabled */
          enableDigitalInputISR(p->gpioPin);             /* Enable the interrupt handler */
          Serial.printf("[HW] Submod %d: ISR Enabled (Pin %d)\n", i, p->gpioPin);
        }
        break;

      case OUT_GPIO_DIGITAL_ID:
      case DISP_ANALOG_BACKLIGHT_ID:
      case DISP_ANALOG_LED_STRIP_ID:
      case DISP_MONOCHROME_LED_ID:
      case DISP_STROBE_MODULE_ID:
        trackers[i].isConfigured = true; /* Mark as configured for the output task (blink, strobe and momentary) */
        initGpioOutput(i, sub);
        break;

      case OUT_GPIO_PWM_ID:
        initPwmHardware(i, sub);
        break;

      case INPUT_ANALOG_ADC_ID:
        initAnalogInput(i, sub);
        break;

      case DISP_TOUCHSCREEN_LCD_ID:
        /* Touchscreen init here if needed */
        Serial.printf("Submod %d: Touchscreen LCD Identified\n", i);
        break;

      default:
        /* No hardware init available */
        Serial.printf("Submod %d: No hardware init available for ID 0x%03X\n", i, sub.introMsgId);
        break;
    } /* switch (sub.introMsgId) */
  } /* for (int i = 0; i < MAX_SUB_MODULES; i++) */
} /* initHardware() */

/**
 * @brief Calculates a 16-bit CRC for the node configuration.
 * @details Uses the ESP32 ROM CRC16 implementation (CCITT).
 * @param node Reference to the canNodeInfo struct.
 * @return uint16_t The calculated checksum.
 */
uint16_t crc16_ccitt(const uint8_t* data, size_t length) {
  uint16_t crc = 0xFFFF; // Initial value
  while (length--) {
    crc ^= (uint16_t)*data++ << 8;
    for (int i = 0; i < 8; i++) {
      if (crc & 0x8000) {
        crc = (crc << 1) ^ 0x1021; // Polynomial
      } else {
        crc <<= 1;
      }
    }
  }
  return crc;
}

/**
 * @brief Calculates a 16-bit CRC for the entire node configuration.
 */
const uint16_t getConfigurationCRC(const nodeInfo_t& node) {
  /* Hash the entire struct without worrying about internal fields */
  return crc16_ccitt((const uint8_t*)&node, sizeof(nodeInfo_t));
}

const uint16_t getSubModuleCRC(const subModule_t& sub) {
  /* Hash the submodule only */
  return crc16_ccitt((const uint8_t*)&sub, sizeof(subModule_t));
}

void TaskOTA(void *pvParameters) {
  /* Wait until WiFi is connected */
  while (!wifi_connected) {
    vTaskDelay(200 / portTICK_PERIOD_MS);
  }

  Serial.println("[RTOS] OTA task started.");

  /* Configure ArduinoOTA */
  ArduinoOTA.setHostname(hostname);
  ArduinoOTA.setPassword(ota_password);

  ArduinoOTA.onStart([]() {
    can_suspended = true; /* Stop the task logic */

    /* stop timer0 isr if running */
    if (Timer0_Cfg != NULL) {
      timerAlarmDisable(Timer0_Cfg);
      timerDetachInterrupt(Timer0_Cfg);
    }

    /* Suspend tasks that might be using hardware */
    if (xTWAIHandle != NULL)   vTaskSuspend(xTWAIHandle);   /* suspend the TWAI task */
    if (xOutputHandle != NULL) vTaskSuspend(xOutputHandle); /* suspend the output switch task */
    if (xInputHandle != NULL)  vTaskSuspend(xInputHandle);  /* suspend the input event task */
#ifdef ESP32CYD
    if (xDisplayHandle != NULL) vTaskSuspend(xDisplayHandle); /* suspend the display task */
    if (xTouchHandle != NULL) vTaskSuspend(xTouchHandle); /* suspend the touch task */
#endif
    /* Stop the TWAI driver */
    twai_stop();

    Serial.println("OTA Start: Background tasks suspended, starting flash... ");
  });
  ArduinoOTA.onEnd([]() {
    Serial.println("\nOTA End");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    Serial.print(".");
  });
  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("OTA Error[%u]\n", error);
    ESP.restart(); /* Cleanest way to recover CAN hardware after a failed OTA */
  });

  /* Option A: Always enable OTA listener */
  ArduinoOTA.begin();
  ota_started = true;
  Serial.println("[OTA] OTA library ready");

  /* Main loop: handle OTA requests */
  for (;;) {
    ArduinoOTA.handle();
    vTaskDelay(pdMS_TO_TICKS(5));
  }

  vTaskDelete(NULL);
}


/**
 * @brief Reads the ESP32 station MAC address and extracts a 4-byte Node ID.
 */
void readMacAddress() {
  uint8_t baseMac[6];
  esp_efuse_mac_get_default(baseMac); /* get the factory-burned MAC address */
  /* Copy 4 bytes starting from index 2 of baseMac into myNodeID */
  memcpy((void*)myNodeID, &baseMac[2], 4);

  Serial.print("[INIT] Node ID extracted: ");
  for(int i = 0; i < 4; i++) {
    Serial.printf("%02X ", myNodeID[i]);
  }
  Serial.println();
}

/**
 * @brief Sets up the node info based on the node type
 * @details Configure information on the node and submodules based on the node type and data provided by the user
 *
 * @param nodeType
 */

