gordonthree/esp32-canbus-node-v3/src/main.cpp
    // Serial.printf("Submod %d: Blinker Init (Pin %d) (%d Hz) (Duty %d) on Timer %d\n",
    //               submodIdx, pin, freq, duty, (int)selected_timer);
}

/**
 * @brief Stops an active LEDC blinker and unbinds the hardware pin.
 * @details Detaches the GPIO from the LEDC peripheral, resets the pin to LOW,
 * and clears the tracker status.
 * @param idx The index of the blinker in the global tracker array.
 */
void stopHardwarePwm(uint8_t submodIdx) {
    uint8_t idx = (submodIdx - 1); /* submodule 0 will never be a blinker, so subtract 1 from index */

    /** Safety check: Ensure index does not exceed hardware timer or array limits. */
    if (idx >= LEDC_MAX_TIMERS) {
        Serial.println("[PWM] Invalid index for LEDC stop timer, expected 0 to 3.");
        return;
    }


    /** Retrieve the pin from the tracker before clearing it in the array     */
    uint8_t pin = blinkers[idx].hwPin;
    if (blinkers[idx].isActive) {
        /** Detach the GPIO pin from the LEDC peripheral */
        ledc_stop(LEDC_LOW_SPEED_MODE, static_cast<ledc_channel_t>(idx), 0); /* 0 sets the idle level to low */

        /** Explicitly set the pin to LOW to ensure a clean off-state  */
        pinMode(pin, OUTPUT);
        digitalWrite(pin, LOW);

        /** Update tracker state */
        blinkers[idx].isActive = false;

        Serial.printf("[PWM] Submod %d: Blinker Stopped (Pin %d)\n", idx, pin);
    }
}

/**
 * @brief Handle momentary output behavior.
 *
 * Behavior:
 *   - When triggered, output goes HIGH
 *   - After duration expires, output returns LOW
 */
void handleMomentaryLogic(subModule_t &sub, outputTracker_t &trk) {
  const personalityDef_t* p = &g_personalityTable[sub.personalityIndex]; /**< Pointer to the personality definition for this sub-module */

  uint8_t pin = p->gpioPin;

  if (!trk.isActive)
    return;

  /* If timer still running → keep output HIGH */
  if (millis() < trk.nextActionTime) {
    digitalWrite(pin, HIGH);
    return;
  }

  /* Timer expired → turn output OFF */
  digitalWrite(pin, LOW);
  trk.isActive = false;
}


void readCydLdr() {
#ifndef ESP32CYD
    return;
#else
    const uint8_t  oversample_count = 16;       /* Samples for precision */
    const uint8_t  ldr_submod_idx   = 5;        /* TODO: Make this configurable */
    
    uint32_t       raw_accumulator = 0;

    /* Perform over-sampling on pin 34 */
    Serial.printf("CYD LDR: %d\n", analogRead(CYD_LDR_PIN));
    for (uint8_t i = 0; i < oversample_count; i++) {
        raw_accumulator += analogRead(CYD_LDR_PIN);
    }
    
    /* Result is 12-bit (0-4095) */
    uint16_t ldr_raw = (uint16_t)(raw_accumulator / oversample_count);

    /* --- Goal 1: Send CAN Message (0x50F) --- */
    uint8_t data[DATA_ADC_RAW_DLC];
    /* Use your global myNodeID array */
    memcpy(&data[0], (const void*)myNodeID, 4);
    
    data[4] = ldr_submod_idx;           /* Sensor ID / Submodule index */
    data[5] = (uint8_t)(ldr_raw >> 8);  /* High byte of 12-bit ADC */
    data[6] = (uint8_t)(ldr_raw & 0xFF);/* Low byte of 12-bit ADC */

    /* Reusing your existing TWAI routine */
    send_message(DATA_ADC_RAW_ID, data, DATA_ADC_RAW_DLC);
#endif
}

static void setDisplayMode(twai_message_t& msg, uint8_t displayMode = DISPLAY_MODE_OFF) {
  uint8_t displayID = msg.data[4]; /* display ID */

  if (displayID >= MAX_SUB_MODULES) return; /* invalid display ID */
  subModule_t& sub = node.subModule[displayID]; /* get submodule reference */
  const personalityDef_t* p = &g_personalityTable[sub.personalityIndex]; /**< Pointer to the personality definition for this sub-module */

  uint8_t displayPin = p->gpioPin; /* get output pin */

  switch (displayMode) {
    case DISPLAY_MODE_OFF: // display off
      stopHardwarePwm(displayID);
      digitalWrite(displayPin, LOW);
      Serial.printf("Display %d OFF\n", displayID);
      break;
    case DISPLAY_MODE_ON: // display on
      stopHardwarePwm(displayID);
      digitalWrite(displayPin, HIGH);
      Serial.printf("Display %d ON\n", displayID);
      break;
    case DISPLAY_MODE_CLEAR: // clear display
      stopHardwarePwm(displayID);
      Serial.printf("Display %d CLEAR\n", displayID);
      break;
    case DISPLAY_MODE_FLASH: // flash display
    {
      uint8_t flashRate = msg.data[5];
      handleHardwarePwm(displayID, displayPin, flashRate);
      Serial.printf("Display %d FLASH AT %d rate\n", displayID, flashRate);
    }
      break;
    default:
      Serial.println("Invalid display mode");
      break;
  }
}

static void setSwMomDur(twai_message_t& msg) {
  uint8_t switchID = msg.data[4];                  /* switch ID */
  uint8_t momDur = msg.data[5];                    /* momentary duration */
  if (switchID >= MAX_SUB_MODULES) return;         /* invalid switch ID */
  subModule_t& sub = node.subModule[switchID];     /* get submodule reference */

  sub.config.gpioOutput.param1 = momDur;   /* update momentary duration */

  Serial.printf("Momentary Duration: %d Switch: %d\n", sub.config.gpioOutput.param1, switchID);
}


static void setSwBlinkDelay(twai_message_t& msg) {
  uint8_t switchID = msg.data[4];                      /* switch ID */
  uint8_t freq     = msg.data[5];                      /* blink delay */
  if (switchID >= MAX_SUB_MODULES) return;             /* invalid switch ID */
  subModule_t& sub = node.subModule[switchID];         /* get submodule reference */
  const personalityDef_t* p = &g_personalityTable[sub.personalityIndex]; /**< Pointer to the personality definition for this sub-module */
  uint8_t pin = p->gpioPin; /* get output pin */
  sub.config.gpioOutput.param1 = freq;            /* update blink delay */
  handleHardwarePwm(switchID, pin, freq);       /* update hardware blinker */

  Serial.printf("Blink Delay: %d Switch: %d\n", sub.config.gpioOutput.param1, switchID);
}

static void setSwStrobePat(twai_message_t& msg) {
  uint8_t switchID = msg.data[4];               /* switch ID */
  uint8_t strobePat = msg.data[5];              /* strobe pattern */
  if (switchID >= MAX_SUB_MODULES) return;      /* invalid switch ID */
  subModule_t& sub = node.subModule[switchID];  /* get submodule reference */
  sub.config.gpioOutput.param2 = strobePat; /* update strobe pattern */

