gordonthree/esp32-canbus-node-v3/src/main.cpp
    case OUT_STATE_ON: // switch on
      switch (sub.config.gpioOutput.mode) {
        case OUT_MODE_MOMENTARY: /* If we are in momentary mode, 'ON' should behave like a trigger */
          trackers[switchID].nextActionTime = millis() + 
            (MOM_SW_SCALING_FACTOR * sub.config.gpioOutput.param1);
          digitalWrite(outPin, HIGH); /* Ensure it starts HIGH */
          trackers[switchID].isActive = true;
          break;
        case OUT_MODE_BLINK: /* If we are in blink mode, 'ON' should behave like a trigger */
        case OUT_MODE_PWM: /* Use LEDC hardware for blinking and pwm*/
        {
          //TODO: blinkOutput is going away, need to refactor to a more generic pwmOutput instead
          uint32_t freq = (uint32_t)(sub.config.gpioOutput.param1 * BLINK_SCALING_FACTOR);
          uint8_t  pin  = outPin;
          if (freq == 0) { /* for debugging don't let the blink rate equal 0*/
            freq = 5; //TODO: FIX THIS NO MAGIC NUMBERS
            sub.config.gpioOutput.param1 = freq;
          }
          handleHardwarePwm(switchID, pin, freq);
          break;
        }

        default:
          digitalWrite(outPin, HIGH); /* set output driver high */
          Serial.printf("Switch %d (pin %d) ON\n", switchID, outPin);
          break;
      }
      break;

    case OUT_STATE_MOMENTARY: // momentary press
      /* let the output task deal with this */
      Serial.printf("Output Task Switch %d (pin %d) MOMENTARY (%dms)\n", switchID, outPin, (MOM_SW_SCALING_FACTOR * sub.config.gpioOutput.param1));

      trackers[switchID].nextActionTime = millis() + (MOM_SW_SCALING_FACTOR * sub.config.gpioOutput.param1);
      digitalWrite(outPin, HIGH); /* Ensure it starts HIGH */
      trackers[switchID].isActive = true; /* enable momentary timer */
      trackers[switchID].isConfigured = true; /* enable this output for nonblocking control*/
      break;

    default:
      Serial.println("Invalid switch state");
      break;
  }
}







/**
 * @brief Get the current epoch time from the system clock.
 *
 * This function reads the current time from the ESP32 system clock
 * and returns it as a uint32_t representing the number of seconds
 * since the epoch (January 1, 1970, 00:00:00 UTC).
 *
 * @return uint32_t The current epoch time in seconds.
 */

static uint32_t getEpochTime() {
  /* Get time from the system clock and return it as a uint32_t */
  struct timespec newTime;

  clock_gettime(CLOCK_REALTIME, &newTime); /* Read time from ESP32 clock*/

  return (uint32_t)newTime.tv_sec;
}

/**
 * @brief Send a uint32_t on the CAN bus
 * @param bigNumber The uint32_t to be sent
 * @param canMsgId The message ID to use for transmission (default: DATA_EPOCH_ID)
 * @param dlc The data length code to use for transmission (default: DATA_EPOCH_DLC)
 *
 * This function takes a uint32_t and sends it on the CAN bus
 * with the given message ID and data length code.
 */
static void sendCanUint32(uint32_t bigNumber, uint32_t canMsgId = DATA_EPOCH_ID, uint8_t dlc = DATA_EPOCH_DLC) {
  /* Take a uint32_t and put it on the bus */
  uint8_t dataBytes[dlc];

  dataBytes[0] = myNodeID[0]; // set node ID
  dataBytes[1] = myNodeID[1]; // set node ID
  dataBytes[2] = myNodeID[2]; // set node ID
  dataBytes[3] = myNodeID[3]; // set node ID
  dataBytes[4] = (bigNumber >> 24) & 0xFF;
  dataBytes[5] = (bigNumber >> 16) & 0xFF;
  dataBytes[6] = (bigNumber >> 8) & 0xFF;
  dataBytes[7] = (bigNumber & 0xFF);

  send_message(canMsgId, (uint8_t *)dataBytes, dlc);

}
/**
 * @brief Receive time in seconds and write it to the ESP32 clock
 *
 * This function is used to receive time in seconds from the gateway node and write it to the ESP32 clock.
 * The time received is used to synchronize the ESP32 clock with the gateway node's clock.
 *
 * @param epochTime The time in seconds to be written to the ESP32 clock
 * @return None
 */
static void setEpochTime(uint32_t epochTime) {
/* Receive time in seconds and write it to the ESP32 clock */

  struct timespec newTime;
  newTime.tv_sec = (time_t)epochTime;
  newTime.tv_nsec = 0;
  clock_settime(CLOCK_REALTIME, &newTime);

}

/**
 * @brief Execute one step of the strobe pattern for an output-capable submodule.
 *
 * This function:
 *   - Uses a pattern table (durations in ms)
 *   - Advances through the pattern when the timer expires
 *   - Sets the output HIGH/LOW based on the pattern step
 *   - Updates tracker.nextActionTime for the next step
 *
 * The pattern is defined by the submodule configuration (strobePattern_t).
 * Each pattern is an array of ON/OFF durations.
 */
void handleStrobeLogic(subModule_t &sub, outputTracker_t &trk) {
  const personalityDef_t* p = &g_personalityTable[sub.personalityIndex]; /**< Pointer to the personality definition for this sub-module */
  const uint8_t outPin = p->gpioPin;

  /* If the strobe is not active, do nothing */
  if (!trk.isActive)
    return;

  /* If it's not time to advance the pattern, do nothing */
  if (millis() < trk.nextActionTime)
      return;

  /* Select the pattern based on configuration */
  const uint16_t *pattern = nullptr;
  uint8_t patternSteps = 0;

  switch (sub.config.gpioOutput.param2)
  {
      case STROBE_PATTERN_1: {
          /* Example: ON 50ms, OFF 50ms, ON 50ms, OFF 400ms */
          static const uint16_t p1[] = {50, 50, 50, 400};
          pattern = p1;
          patternSteps = 4;
          break;
      }

      case STROBE_PATTERN_2: {
          /* Example: 3x flash, pause, 5x flash, pause */
          static const uint16_t p2[] = {50,50,50,200, 50,50,50,50,50,400};
          pattern = p2;
          patternSteps = 10;
          break;
      }

      /* Additional patterns can be added here */
      default:
          /* Unknown pattern → disable strobe */
          trk.isActive = false;
          digitalWrite(outPin, LOW);
          return;
  }

  /* Advance to the next step in the pattern */
  trk.currentStep = (trk.currentStep + 1) % patternSteps;

  /* Even steps = ON, Odd steps = OFF */
  bool state = (trk.currentStep % 2 == 0);

  digitalWrite(outPin, state);

  /* Schedule the next step */
  trk.nextActionTime = millis() + pattern[trk.currentStep];
}

/**
 * @brief Handles color commands from the gateway node.
 *
 * @param msg The TWAI message containing the color command.
 * 
 */
void handleColorCommand(twai_message_t& msg)
{
#ifdef ARGB_LED
    uint8_t subIdx     = msg.data[4];
    uint8_t colorIndex = msg.data[5];

