gordonthree/esp32-canbus-node-v3/src/main.cpp
    if (subIdx >= MAX_SUB_MODULES) return;

    auto* strip = g_argbStrips[subIdx];
    if (!strip) return;

    if (colorIndex >= COLOR_PALETTE_SIZE) return;

    PaletteColor p = SystemPalette[colorIndex];

    strip->ClearTo(RgbColor(p.R, p.G, p.B));
    strip->Show();

    Serial.printf("ARGB[%d] = (%d,%d,%d)\n", subIdx, p.R, p.G, p.B);
#endif
}

void manageColorPickerList(twai_message_t& msg) {
#ifndef ESP32CYD  
  return; /* exit function unless we are running on CYD board */
#else
    /* Constants for NVS and Byte logic to avoid magic numbers */
    const char* NVS_NAMESPACE = "cyd_nodes";
    const char* NVS_KEY       = "node_list";

    uint32_t cmd = msg.identifier;

    /* Extract Node ID from data payload if the message contains one */
    uint32_t targetNodeId = 0;
    if (msg.data_length_code >= CAN_NODE_ID_LEN) 
    {
        targetNodeId = ((uint32_t)msg.data[0] << 24) | 
                       ((uint32_t)msg.data[1] << 16) | 
                       ((uint32_t)msg.data[2] << 8)  | 
                        (uint32_t)msg.data[3];
    }

    switch (cmd) 
    {
        case COLORPICKER_READ_NVS_ID: 
        {
            Preferences prefs;
            prefs.begin(NVS_NAMESPACE, true); /* Read-only mode */
            
            size_t bytesAvailable = prefs.getBytesLength(NVS_KEY);
            
            /* Calculate capacity of our existing array in bytes */
            size_t maxArrayBytes = sizeof(ARGBNode) * MAX_ARGB_NODES;

            if (bytesAvailable > 0 && bytesAvailable <= maxArrayBytes) 
            {
                prefs.getBytes(NVS_KEY, (void*)discoveredNodes, bytesAvailable);
                discoveredNodeCount = bytesAvailable / sizeof(ARGBNode);
                Serial.printf("ARGB: Loaded %d nodes from NVS\n", discoveredNodeCount);
            }
            prefs.end();
            break;
        }

        case COLORPICKER_WRITE_NVS_ID: 
        {
            Preferences prefs;
            prefs.begin(NVS_NAMESPACE, false); /* Read-write mode */
            
            /* Save only the active portion of the array */
            size_t bytesToWrite = sizeof(ARGBNode) * discoveredNodeCount;
            prefs.putBytes(NVS_KEY, (const void*)discoveredNodes, bytesToWrite);
            
            prefs.end();
            Serial.println("ARGB: Node list persisted to NVS");
            break;
        }

        case COLORPICKER_PURGE_LIST_ID: 
        {
            memset((void*)discoveredNodes, 0, sizeof(discoveredNodes));
            discoveredNodeCount = 0;
            Serial.println("ARGB: List purged from memory");
            break;
        }

        case COLORPICKER_ADD_ROUTE_ID: 
        {
            if (targetNodeId == 0) return;

            /* Check for existing entry to prevent duplicates */
            bool alreadyExists = false;
            for (int i = 0; i < discoveredNodeCount; i++) 
            {
                if (discoveredNodes[i].id == targetNodeId) 
                {
                    alreadyExists = true;
                    break;
                }
            }

            if (!alreadyExists && (discoveredNodeCount < MAX_ARGB_NODES)) 
            {
                discoveredNodes[discoveredNodeCount].id = targetNodeId;
                discoveredNodes[discoveredNodeCount].lastColorIdx = 0; /* Default to Black/Off */
                discoveredNodes[discoveredNodeCount].active = true;
                discoveredNodeCount++;
                Serial.printf("ARGB: Node 0x%08X added to picker\n", targetNodeId);
            }
            break;
        }

        case COLORPICKER_DEL_ROUTE_ID: 
        {
            for (int i = 0; i < discoveredNodeCount; i++) 
            {
                if (discoveredNodes[i].id == targetNodeId) 
                {
                    /* Shift remaining nodes to maintain a contiguous list */
                    for (int j = i; j < (discoveredNodeCount - 1); j++) 
                    {
                        discoveredNodes[j] = discoveredNodes[j + 1];
                    }
                    discoveredNodeCount--;
                    Serial.printf("ARGB: Node 0x%08X removed\n", targetNodeId);
                    break;
                }
            }
            break;
        }

        case COLORPICKER_SEND_LIST_ID: 
        {
            /* Not yet implemented */
            /* Respond to master with current list status */
            // twai_message_t response;
            // response.identifier = COLORPICKER_SEND_LIST_ID;
            // response.data_length_code = 1;
            // response.data[0] = (uint8_t)discoveredNodeCount;
            // twai_transmit(&response, pdMS_TO_TICKS(10));
            break;
        }

        default:
            Serial.printf("ARGB: Unknown picker management command: 0x%03X\n", cmd);
            break;
    }
#endif
} /* end manageColorPickerList() */



/**
 * @brief Dynamically counts active submodules in the node structure
 * * Scans the subModule array and counts entries with a non-zero introMsgId.
 * This eliminates the need to hard-code subModCnt in the default config.
 * * @return uint8_t Total number of configured submodules
 */
uint8_t countActiveSubModules() {
    uint8_t count = 0;
    /* Iterate through the maximum possible submodules (8) */
    for (int i = 0; i < MAX_SUB_MODULES; i++) {
        if (node.subModule[i].introMsgId != 0) {
            count++;
        }
    }
    return count;
}

/**
 * @brief Send an introduction message about the node
 *
 * This function is called in response to a request from the master node
 * to introduce the node. The function will send an introduction message
 * with the node type and sub-module count. The function will
 * also send an introduction message for each sub-module with the
 * sub-module type and configuration.
 *
 * The function uses a cooldown to prevent spamming the bus every 100ms tick
 */
void sendIntroduction(int msgPtr = 0) {
  uint32_t currentTick = millis();
  uint16_t txMsgID  = 0;
  uint32_t txMsgDLC = 8U; /* Default to 8 bytes */
  uint8_t  msgData[CAN_MAX_DLC];


  /* Update the count dynamically before processing the introduction */
  node.subModCnt = countActiveSubModules();

  memset(&msgData, 0, sizeof(msgData)); /* wipe the buffer before using it */

  /* Consistent 32-bit Node ID across all intro frames */
  packUint32ToBytes(node.nodeID, &msgData[0]);

