gordonthree/esp32-canbus-node-v3/src/main.cpp
/* 0: Node Identity */
  if (msgPtr == 0) {
    /* Check FLAG_VALID_CONFIG flag, if it's set use the in-memory CRC, if not use 0xFFFF */
    uint16_t txCrc = FLAG_VALID_CONFIG ? getConfigurationCRC(node) : CRC_INVALID_CONFIG;
    // uint16_t txCrc = getConfigurationCRC(node);

    txMsgID    = node.nodeTypeMsg;
    msgData[4] = node.subModCnt;
    msgData[5] = (uint8_t)(txCrc >> 8);
    msgData[6] = (uint8_t)(txCrc);
    // Serial.printf("TX INTRO: NODE 0x%08X SUBMOD %02u (Type: 0x%03X, CRC: 0x%04X)\n", node.nodeID, msgData[4], txMsgID, txCrc);
  }
/* >0: Sub-module Identity (Part A and Part B) */
  else {
    uint8_t modIdx = (uint8_t)((msgPtr - 1) / 2); /**< Map ptr to sub-module index */
    bool isPartB   = ((msgPtr - 1) % 2) != 0;      /**< Alternate A/B sequence */
    
    if (modIdx >= node.subModCnt) return;
    subModule_t& sub = node.subModule[modIdx];
    const personalityDef_t* p = &g_personalityTable[sub.personalityIndex]; /**< Pointer to the personality definition for this sub-module */

    const uint16_t dataMsgId  = p->dataMsgId;
    const uint8_t  dataMsgDlc = p->dataMsgDlc; 

    txMsgID = sub.introMsgId;

    if (!isPartB) {
        /* Part A: Configuration Data */
        msgData[4] = modIdx; /**< bits 0-6: index, bit 7: 0 (Part A) */
        msgData[5] = sub.config.rawConfig[0];
        msgData[6] = sub.config.rawConfig[1];
        msgData[7] = sub.config.rawConfig[2];
    } else {
        /* Part B: Telemetry/Operational Data */
        msgData[4] = modIdx | SUBMOD_PART_B_FLAG; /**< Set bit 7 to indicate Part B */
        msgData[5] = (uint8_t)(dataMsgId >> 8);
        msgData[6] = (uint8_t)(dataMsgId);
        /* Pack DLC (4 bits) and SaveState (1 bit) into byte 7 */
        msgData[7] = (dataMsgDlc & 0x0F) | (sub.submod_flags ? SUBMOD_PART_B_FLAG : 0x00);
    }

    if (txMsgID == 0) {
        return;  /* error condition, msg ID is invalid, exit the routine */
    }

    Serial.printf("TX INTRO: MOD 0x%03X at Idx %i (Cfg: %02X %02X %02X)\n",
                  txMsgID, msgData[4], msgData[5], msgData[6], msgData[7]);
  }
  /* put the message on the bus */
  send_message(txMsgID, msgData, txMsgDLC);

} /* end sendIntroduction */

static void buildSyntheticMessage(const router_action_t &action,
                                  twai_message_t &outMsg)
{
    // Start with a clean message
    memset(&outMsg, 0, sizeof(outMsg));

    outMsg.identifier = action.actionMsgId;
    outMsg.data_length_code = 8;   // Always 8 for consumer actions

    // Bytes 0–3 = NodeID (same as incoming messages)
    packUint32ToBytes(node.nodeID, &outMsg.data[0]);

    // Byte 4 = submodule index
    outMsg.data[4] = action.sub_idx;

    // Byte 5..7 = parameters from router
    outMsg.data[5] = action.param[0];
    outMsg.data[6] = action.param[1];
    outMsg.data[7] = action.param[2];
}


static void handleCanRX(twai_message_t &message) {
  // twai_message_t altmessage;
  bool msgFlag = false;

  if ((message.identifier == SET_ARGB_STRIP_COLOR_ID) || (message.identifier == SET_ARGB_BUTTON_COLOR_ID)) {
    handleColorCommand(message);
  }

  if (message.data_length_code > 0) { // message contains data, check if it is for us
    uint8_t rxUnitID[4] = {message.data[0], message.data[1], message.data[2], message.data[3]};
    // memcmp((const uint8_t *)rxUnitID, (const uint8_t *)myNodeID, 4);

    if (memcmp(message.data, (const uint8_t *)myNodeID, 4) == 0) {
      msgFlag = true; // message is for us
    } else {
      msgFlag = false; // message is not for us
    }
  } else {
    msgFlag = true; // general broadcast message is valid, messagae has no node id assigned
    Serial.printf("RX BROADCAST MSG: 0x%x NO DATA\n", message.identifier);
  }

  if (!msgFlag) {
    // Serial.println("Message does not match our ID, end of process.");
    return; // message is not for us
  }

  /* debug: dump message data */
  Serial.printf("RX MSG: 0x%03X DATA: ", message.identifier);
  for (int i = 0; i < message.data_length_code; i++) {
    Serial.printf("0x%02X ", message.data[i]);
  }
  Serial.println();

  // Run consumer routing logic for every valid message
  router_action_t action = {0};
  /** recast message so it matches the checkRoutes() signature */
  const can_msg_t newMsg = toCanMsg(&message);
  bool takeAction = checkRoutes(&newMsg, &action);

  twai_message_t msgToConsume;

  if (takeAction) {
      buildSyntheticMessage(action, msgToConsume);
  } else {
      msgToConsume = message;  // use original
  }

  /** extract submodule index */
  uint8_t modIdx = msgToConsume.data[4];                                                     /* byte 4 holds the sub module index */


  switch (msgToConsume.identifier) 
  {
    case ROUTE_TAKE_NO_ACTION:          // no action 0xFFFF
      break;

    case CFG_PRODUCER_CFG_ID: /**< Configure a single producer submodule */
      if (isValidSubModuleIndex(modIdx) == false) {
        Serial.printf("Invalid sub module index %d\n", modIdx);
        break;
      }
      handleProducerCfg(&msgToConsume);
      break;

    case CFG_PRODUCER_WRITE_NVS_ID: /**< Commit producer config to NVS. */
      if (isValidSubModuleIndex(modIdx) == false) {
        Serial.printf("Invalid sub module index %d\n", modIdx);
        break;
      }
      requestProducerSave();
      break;

    case CFG_PRODUCER_READ_NVS_ID: /**< Request producer config for all submodules */
      if (isValidSubModuleIndex(modIdx) == false) {
        Serial.printf("Invalid sub module index %d\n", modIdx);
        break;
      }
      requestProducerLoad();
      break;

    case REQ_PRODUCER_CFG_ID: /**< Request producer config  for idx */
      if (isValidSubModuleIndex(modIdx) == false) {
        Serial.printf("Invalid sub module index %d\n", modIdx);
        break;
      }
      break;

    case RESP_PRODUCER_CFG_ID: /**< Node responds with requested data using this message id */
      if (isValidSubModuleIndex(modIdx) == false) {
        Serial.printf("Invalid sub module index %d\n", modIdx);
        break;
      }
      break;

    case CFG_PRODUCER_PURGE_ID: /**< Purge the producer list */
      if (isValidSubModuleIndex(modIdx) == false) {
        Serial.printf("Invalid sub module index %d\n", modIdx);
        break;
        producerPurgeSingle(modIdx);
      }
      break;

    case CFG_PRODUCER_DEFAULTS_ID: /**< Reset the producer at idx to defaults */
      if (isValidSubModuleIndex(modIdx) == false) {
        Serial.printf("Invalid sub module index %d\n", modIdx);
        break;
      }
      producerDefaultSingle(modIdx);
      break;

    case CFG_PRODUCER_APPLY_ID: /**< NO-OP Producer config is applied instantly */
      if (isValidSubModuleIndex(modIdx) == false) {
        Serial.printf("Invalid sub module index %d\n", modIdx);
        break;
      }
      break;


