gordonthree/esp32-canbus-node-v3/src/main.cpp
    case CFG_PRODUCER_ENABLE_ID: /**< Enable the producer at idx */
      {
        if (isValidSubModuleIndex(modIdx) == false) {
          Serial.printf("Invalid sub module index %d\n", modIdx);
          break;
        }
        const personalityDef_t* p = &g_personalityTable[node.subModule[modIdx].personalityIndex];
        if (!p) 
        {
          Serial.printf("Personality not found for index %d\n", modIdx);
          break;
        }
        producerEnable(modIdx);            /* Enable the producer */
        enableDigitalInputISR(p->gpioPin); /* Enable the digital input interrupt */

        break;
      }

    case CFG_PRODUCER_DISABLE_ID: /**< Disable the producer at idx */
      {
        if (isValidSubModuleIndex(modIdx) == false) {
          Serial.printf("Invalid sub module index %d\n", modIdx);
          break;
        }
        const personalityDef_t* p = &g_personalityTable[node.subModule[modIdx].personalityIndex];
        if (!p) 
        {
          Serial.printf("Personality not found for index %d\n", modIdx);
          break;
        }
        producerDisable(modIdx);            /* Disable the producer */
        disableDigitalInputISR(p->gpioPin); /* Disable the digital input interrupt */
        break;
      }

    case CFG_PRODUCER_TOGGLE_ID:        /**< Toggle operation of producer at idx */
      // Not implemented
      break;

    case REQ_PRODUCER_LIST_ID: /**< Ask the node to dump the entire producer cfg list */
      if (isValidSubModuleIndex(modIdx) == false) {
        Serial.printf("Invalid sub module index %d\n", modIdx);
        break;
      }
      break;
    

    case PRODUCER_LIST_BEGIN_ID: /**< Node will announce the count of defined producers */
      if (isValidSubModuleIndex(modIdx) == false) {
        Serial.printf("Invalid sub module index %d\n", modIdx);
        break;
      }
      break;

    case PRODUCER_LIST_DATA_ID: /**< Producer cfg data for index */
      if (isValidSubModuleIndex(modIdx) == false) {
        Serial.printf("Invalid sub module index %d\n", modIdx);
        break;
      }
      break;

    case PRODUCER_LIST_END_ID: /**< Node will announce the end of the defined producers list */
      if (isValidSubModuleIndex(modIdx) == false) {
        Serial.printf("Invalid sub module index %d\n", modIdx);
        break;
      }
      break;

    case SW_SET_PWM_DUTY_ID:      // set output switch pwm duty
      setPWMDuty(msgToConsume);
      break;
    case SW_SET_PWM_FREQ_ID:      // set output switch pwm frequency
      setPWMFreq(msgToConsume);
      break;
    case SW_SET_MODE_ID:           // setup output switch modes
      setSwitchMode(msgToConsume);
      break;
    case SW_SET_OFF_ID:            // set output switch off
      setSwitchState(msgToConsume, OUT_STATE_OFF);
      break;
    case SW_SET_ON_ID:             // set output switch on
      setSwitchState(msgToConsume, OUT_STATE_ON);
      break;
    case SW_MOM_PRESS_ID:          // set output switch momentary press
      setSwitchState(msgToConsume, OUT_STATE_MOMENTARY);
      break;
    case SW_SET_BLINK_DELAY_ID:          // set output switch blink delay
      setSwBlinkDelay(msgToConsume);
      break;
    case SW_SET_STROBE_PAT_ID:          // set output switch strobe pattern
      setSwStrobePat(msgToConsume);
      break;
    case SET_DISPLAY_OFF_ID:          // set display off
      setDisplayMode(msgToConsume, DISPLAY_MODE_OFF);
      break;
    case SET_DISPLAY_ON_ID:          // set display on
      setDisplayMode(msgToConsume, DISPLAY_MODE_ON);
      break;
    case SET_DISPLAY_FLASH_ID:          // flash display backlight
      setDisplayMode(msgToConsume, DISPLAY_MODE_FLASH);
      break;
    case SET_ARGB_STRIP_COLOR_ID:          /* set ARGB color */
      handleColorCommand(msgToConsume); /* byte 4 is the sub module index, byte 5 is the color index */
      break;
    case CFG_SUB_DATA_MSG_ID:           /* setup sub module data message */
      /* no longer user configured */
      break;
    case CFG_SUB_INTRO_MSG_ID:          /* setup sub module intro message */
      {
        if (isValidSubModuleIndex(modIdx) == false) {
          Serial.printf("Invalid sub module index %d\n", modIdx);
          break;
        }
        subModule_t& sub = node.subModule[modIdx];

        sub.introMsgId    = ((msgToConsume.data[5] << 8) | (msgToConsume.data[6] & 0xFF));    /* bytes 5:6 hold the intro message ID */
        sub.introMsgDLC   = msgToConsume.data[7];                               /* byte 7 holds the intro message DLC */
        Serial.printf("Update Sub %d INTRO MSG: 0x%03X DLC: %d\n", modIdx, sub.introMsgId, sub.introMsgDLC);
      }

      break;

    case CFG_ARGB_STRIP_ID:                                                     /* setup ARGB channel */
      {
        if (isValidSubModuleIndex(modIdx) == false) {
          Serial.printf("Invalid sub module index %d\n", modIdx);
          break;
        }
        subModule_t& sub = node.subModule[modIdx];
        sub.config.argb.reserved   = msgToConsume.data[5];       /* reserved, not used */
        sub.config.argb.ledCount   = msgToConsume.data[6];       /* byte 6 holds the number of LEDs (max 255)*/
        sub.config.argb.colorOrder = msgToConsume.data[7];       /* byte 7 holds the color order */
      }
      break;
    case CFG_DIGITAL_INPUT_ID: /**< Setup digital input channel */
      {
        if (isValidSubModuleIndex(modIdx) == false) {
          Serial.printf("Invalid sub module index %d\n", modIdx);
          break;
        }
        subModule_t& sub = node.subModule[modIdx];

        sub.config.gpioInput.flags       = msgToConsume.data[5];  /* Input resistor configuration */
        sub.config.gpioInput.debounce_ms = msgToConsume.data[6];  /* input debounce time */
        sub.config.gpioInput.reserved    = msgToConsume.data[6];  /* reserved byte */

      }
      break;

    case CFG_ANALOG_INPUT_ID: /**< Setup analog ADC input channel */
      {
        if (isValidSubModuleIndex(modIdx) == false) {
          Serial.printf("Invalid sub module index %d\n", modIdx);
          break;
        }
        subModule_t& sub = node.subModule[modIdx];

        sub.config.analogInput.overSampleFlag = msgToConsume.data[5];
        sub.config.analogInput.reserved1      = msgToConsume.data[6]; /* store reserved byte if sent */
        sub.config.analogInput.reserved2      = msgToConsume.data[7]; /* store reserved byte if sent */
      }
      break;

