gordonthree/esp32-canbus-node-v3/src/main.cpp
    /* Lookup the pin */
    uint8_t myPin = p->gpioPin;

    /* generic storage for value */
    uint32_t value = 0;

    /* skip disabled submodules */
    if (sub->submod_flags & SUBMOD_FLAG_DISABLED)
      continue;

    switch (sub->personalityId)
    {
      /* Addressable RGB output*/
      case PERS_ARGB_OUTPUT:
        // TODO: Figure out how to read NeoPixelBus status?
        break;

      /* Analog RGBW output */
      case PERS_RGBW_OUTPUT:
        // TODO
        break;

      /* Analog DAC output */
      case PERS_ANA_OUTPUT:
        // TODO: Read DAC output value?
        break;
      
      /* Digital GPIO personalities */
      case PERS_GPIO_OUTPUT:
      case PERS_GPIO_INPUT:
        // sub->runTime.valueU32 = digitalRead(myPin); /**< Capture digital value */
        break;

        /* Analog ADC input */
      case PERS_ANALOG_INPUT:
        sub->runTime.valueU32 = analogRead(myPin); /**< Capture analog value */
        break;

      case VIRT_FREE_HEAP:
          value = (uint32_t)xPortGetFreeHeapSize();
          break;

      case VIRT_WIFI_RSSI:
      {
        int rssi = WiFi.RSSI();
        if (rssi < 0) rssi = -rssi;
        value = (uint32_t)rssi;
        break;              
      }

      case VIRT_RTOS_HIGHWATERMARK:
        value = (uint32_t)uxTaskGetStackHighWaterMark(NULL);
        break;

      case VIRT_INTERNAL_TEMPERATURE:
        value = (uint32_t)temperatureRead();
        break;

      case VIRT_VREF_VOLTAGE:
        // value = (uint32_t)readInternalVref();
        value = 1024; // TODO: implement actual function
        break;

      default:
        // Unknown virtual personality — ignore safely
        continue;
      }

      // sub->runTime.valueU32       = value;     /* update value */
      // sub->runTime.last_change_ms = millis();  /* update timestamp */
    } /* end of for loop */
}


static void handleProducerTick(uint32_t now)
{
    /** Check for producer event */
    producer_event_t evt = producerTick(now); 

    if (evt.error) {
        Serial.println("[ERR] ProducerTick returned error, aborting producer processing");
        return;
    }
    if (!evt.ready)
        return;

    if (evt.sub_idx >= node.subModCnt) {
        Serial.printf("[ERR] ProducerTick: bad sub_idx %u (max %u)\n",
                      evt.sub_idx, node.subModCnt - 1);
        return;
    }        

    /** Lookup personality */
    const subModule_t    &sub = node.subModule[evt.sub_idx];
    const personalityDef_t *p = &g_personalityTable[sub.personalityIndex];
    if (!p) {
        Serial.printf("Producer: personality lookup failed for sub %u\n", evt.sub_idx);
        return;
    }

    uint8_t dlc = p->dataMsgDlc;
    if (dlc < CAN_DATAMSG_MIN_DLC) dlc = CAN_DATAMSG_MIN_DLC;  /**< enforce minimum DLC for producer messages 6-bytes */
    if (dlc > CAN_MAX_DLC) dlc = CAN_MAX_DLC; /**< enforce maximum DLC */

    uint8_t payload[CAN_MAX_DLC] = {0}; /**< zero-initialize */

    /* Node ID (big-endian) */
    payload[0] = (node.nodeID >> BYTE_SHIFT3) & BYTE_MASK;
    payload[1] = (node.nodeID >> BYTE_SHIFT2) & BYTE_MASK;
    payload[2] = (node.nodeID >> BYTE_SHIFT)  & BYTE_MASK;
    payload[3] = (node.nodeID)                & BYTE_MASK;

    /* Submodule index */
    payload[4] = evt.sub_idx;

    /* Scalar value (big-endian) */
    if (dlc > 5) payload[5] = (evt.value >> BYTE_SHIFT2) & BYTE_MASK;
    if (dlc > 6) payload[6] = (evt.value >> BYTE_SHIFT)  & BYTE_MASK;
    if (dlc > 7) payload[7] = (evt.value)                & BYTE_MASK;

    /* Send message */
    send_message(p->dataMsgId, payload, dlc);

    Serial.printf("ProducerTx: sub %u msg 0x%03X dlc %u val %u\n",
                  evt.sub_idx, p->dataMsgId, dlc, evt.value);
}


/**
 * @brief Manages periodic transmissions in TaskTWAI
 */
void managePeriodicMessages() {
    static uint32_t lastHeartbeat = 0;
    static uint32_t lastIntro = 0;
    uint32_t currentMillis = millis();

    /** Introduction as Heartbeat - Every 10 Seconds
        We send this as the heartbeat to save bandwidth,
        unless FLAG_SEND_INTRODUCTION is manually set by a Master request. */
    if (currentMillis - lastIntro >= 10000) {
        lastIntro = currentMillis;
        Serial.printf("Sending heartbeat (ptr = %i)\n", introMsgPtr);
        sendIntroduction(0); /* send the node introduction message as heartbeat */
        readCydLdr(); /* Read CYD LDR and send that data to the bus */

        /* If we are stuck mid-sequence, reset after 10s of silence */
        if (introMsgPtr != 0) {
            Serial.println("Intro sequence timed out, resetting pointer.");
            introMsgPtr = 0;
        }
    }

  /** Update physical submodules */
  updateSubModules();

  /** Call the producer tick */
  handleProducerTick(currentMillis);
    
}

static void processGpioEvent(uint8_t subIdx, uint8_t raw)
{
  if (subIdx < 0 || subIdx >= MAX_SUB_MODULES)
      return;

  subModule_t* sub          = &node.subModule[subIdx];
  const personalityDef_t* p = &g_personalityTable[sub->personalityIndex];
  const uint8_t pinNum      = p->gpioPin;

  if (pinNum >= GPIO_NUM_MAX)
    return;

  if (!isrGpio.enabled[pinNum])
    return;

  Serial.printf("[INPUT] sub=%u pin=%u raw=%u\n",
            subIdx, pinNum, raw);

  const gpio_num_t pin         = (gpio_num_t)pinNum;
  const uint32_t   now         = millis();  /* timestamp */

  const uint8_t    debounceMs  = sub->config.gpioInput.debounce_ms;
  const uint8_t    flags       = sub->config.gpioInput.flags;

  const inputModeType_t mode   = (inputModeType_t)INPUT_FLAG_GET_MODE(flags);
  const inputInvert_t   inv    = (inputInvert_t)INPUT_FLAG_GET_INV(flags);


  /* Apply inversion */
  const uint8_t value = inv ? !raw : raw;

  /* Raw change detection */
  if (value != isrGpio.lastRawState[pinNum]) {
      isrGpio.lastRawState[pinNum] = value;
      isrGpio.lastChangeMs[pinNum] = now;
  }
  // Serial.printf("[RAW] pin=%u value=%u lastRaw=%u lastChange=%u\n",
  //             pinNum,
  //             value,
  //             isrGpio.lastRawState[pinNum],
  //             isrGpio.lastChangeMs[pinNum]);

              

