gordonthree/esp32-canbus-node-v3/src/main.cpp
  // Serial.printf("[DEBOUNCE] now=%u lastChange=%u diff=%u debounceMs=%u\n",
  //             now,
  //             isrGpio.lastChangeMs[pinNum],
  //             now - isrGpio.lastChangeMs[pinNum],
  //             debounceMs);

  /* Debounce window, skip it if debounce is disabled */
  if (debounceMs != INPUT_DEBOUNCE_DISABLED && 
      ((now - isrGpio.lastChangeMs[pinNum]) < debounceMs))
      return;

  /* Stable state detection */
  if (value == isrGpio.stableState[pinNum]) {
      return;  // no stable change, nothing to do
  }

  isrGpio.stableState[pinNum]  = value;
  isrGpio.lastStableMs[pinNum] = now;

  // Serial.printf("[STABLE] sub=%u value=%u mode=%u now=%u\n",
  //             subIdx, value, mode, now);



  /* ============================
    *  MODE: MOMENTARY
    * ============================ */
  if (mode == INPUT_MODE_MOMENTARY) {
      sub->runTime.valueU32       = value ? MOMENTARY_PRESS_VALUE
                                          : MOMENTARY_RELEASE_VALUE;
      sub->runTime.last_change_ms = now;
      // Serial.printf("[MOMENTARY] sub=%u valueU32=%u\n",
      //         subIdx, sub->runTime.valueU32);
  }
  /* ============================
    *  MODE: TOGGLE
    * ============================ */
  else if (mode == INPUT_MODE_TOGGLE && value == GPIO_STATE_HIGH) {
      sub->runTime.valueU32      ^= TOGGLE_BIT_MASK;   // toggle bit 0
      sub->runTime.last_change_ms = now;
      // Serial.printf("[TOGGLE] sub=%u valueU32=%u\n",
      //         subIdx, sub->runTime.valueU32);
  }
  /* ============================
    *  MODE: LATCH
    * ============================ */
  else if (mode == INPUT_MODE_LATCH) {
      sub->runTime.valueU32       = value ? GPIO_LATCH_ON : GPIO_LATCH_OFF;
      sub->runTime.last_change_ms = now;
      // Serial.printf("[LATCH] sub=%u valueU32=%u\n",
      //         subIdx, sub->runTime.valueU32);
  }
  /* ============================
    *  MODE: NORMAL BUTTON
    *  (click, double-click, long press)
    * ============================ */
  else if (mode == INPUT_MODE_NORMAL) {

      if (value == GPIO_STATE_HIGH) {
          isrGpio.pressStartMs[pinNum] = now;
      } else {
          uint32_t pressDuration = now - isrGpio.pressStartMs[pinNum];

          if (pressDuration >= NORMAL_LONG_PRESS_MS) {
              sub->runTime.valueU32 = GPIO_LONG_PRESS;   // long press
          } else {
              if ((now - isrGpio.lastClickMs[pinNum]) < NORMAL_DOUBLE_CLICK_MS) {
                  sub->runTime.valueU32      = GPIO_DOUBLE_CLICK;   // double click
                  isrGpio.clickCount[pinNum] = 0;
              } else {
                  sub->runTime.valueU32      = GPIO_SINGLE_CLICK;   // single click
                  isrGpio.clickCount[pinNum] = 1;
              }
              isrGpio.lastClickMs[pinNum] = now;
          }

          sub->runTime.last_change_ms = now;
      }
    // Serial.printf("[NORMAL] sub=%u valueU32=%u\n",
    //         subIdx, sub->runTime.valueU32);
  } else
  {
    /* fall-through: if mode doesn't match, we just leave runTime unchanged */
    Serial.printf("[UNKNOWN] sub=%u valueU32=%u\n",
          subIdx, sub->runTime.valueU32);
  } /* end of mode switch */
}


void TaskTWAI(void *pvParameters) {
  // give some time at boot for the cpu setup other parameters
  vTaskDelay(100 / portTICK_PERIOD_MS);
  Serial.println("[RTOS] TWAI task started.");

  /* Initialize configuration structures using macro initializers */
  twai_general_config_t g_config = TWAI_GENERAL_CONFIG_DEFAULT((gpio_num_t)TX_PIN, (gpio_num_t)RX_PIN, TWAI_MODE_NORMAL);
  twai_timing_config_t t_config = TWAI_TIMING_CONFIG_500KBITS();
  twai_filter_config_t f_config = TWAI_FILTER_CONFIG_ACCEPT_ALL(); /* accept all messages, filter in software */

  /* Install TWAI driver */
  if (twai_driver_install(&g_config, &t_config, &f_config) == ESP_OK) {
    Serial.println("[TWAI] TWAI installed.");
  } else {
    Serial.println("[TWAI] Failed to install TWAI.");
    vTaskDelete(NULL); /* <--- Safety fix */
  }

  /* Start TWAI driver */
  if (twai_start() == ESP_OK) {
    Serial.println("[TWAI] TWAI started.");
  } else {
    Serial.println("[TWAI] Failed to start TWAI, reboot recommended.");
    vTaskDelete(NULL); /* <--- Safety fix */
  }

  /* Reconfigure alerts to detect frame receive, Bus-Off error and RX queue full states */
  uint32_t alerts_to_enable = TWAI_ALERT_RX_DATA | TWAI_ALERT_ERR_PASS | TWAI_ALERT_RX_QUEUE_FULL | TWAI_ALERT_TX_IDLE | TWAI_ALERT_TX_SUCCESS | TWAI_ALERT_TX_FAILED | TWAI_ALERT_BUS_ERROR;
  if (twai_reconfigure_alerts(alerts_to_enable, NULL) == ESP_OK) {
    Serial.println("[TWAI] TWAI alerts reconfigured.");
  } else {
    Serial.println("[TWAI] Failed to reconfigure alerts.");
    vTaskDelete(NULL); /* <--- Safety fix */
  }

  /* TWAI driver is now successfully installed and started */
  can_driver_installed = true;


  // FLAG_SEND_INTRODUCTION = true; /* send an introduction message */
  introMsgPtr = 0;  /* reset the intro message pointer */
  sendIntroduction(0); /* send the first introduction message */
  int loopCount = 0;

  /** Begin main can bus RX/TX loop */
  for (;;) {
    if (!can_driver_installed || can_suspended) {
      /* Driver not installed or bus suspended */
      vTaskDelay(pdMS_TO_TICKS(100)); /* Idle the task */
      continue; /* Skip the rest of the loop */
    }
    /* Check if alert happened */
    uint32_t alerts_triggered;
    twai_read_alerts(&alerts_triggered, pdMS_TO_TICKS(10));
    twai_status_info_t twaistatus;
    twai_get_status_info(&twaistatus);

    /* Timestamps for throttling Serial output (static to persist across loops) */
    static uint32_t lastErrPassLog = 0;
    static uint32_t lastBusErrLog = 0;
    static uint32_t lastTxFailLog = 0;
    static uint32_t lastRxFullLog = 0;
    const uint32_t LOG_INTERVAL = 2000; /* Log once every 2 seconds max */

    /* Handle alerts */
    if (alerts_triggered & TWAI_ALERT_ERR_PASS) {
      if (millis() - lastErrPassLog > LOG_INTERVAL) {
        Serial.println("[TWAI] Alert: Controller has become error passive.");
        lastErrPassLog = millis();
      }
    }

